potential_topics.md
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org6f537f0">1. Adaptive Governance Topics</a>
<ul>
<li><a href="#org717ff73">1.1. Example Contexts</a>
<ul>
<li><a href="#orgd308706">1.1.1. Managing common-pool resources</a></li>
<li><a href="#org30e5fa8">1.1.2. Attestations in a Decentralized context</a></li>
<li><a href="#org194f0a7">1.1.3. Carbon Credit exchange market</a></li>
<li><a href="#org16b66da">1.1.4. Traffic/Parking Code</a></li>
<li><a href="#orgb0452b5">1.1.5. Intent-Matching</a></li>
<li><a href="#org9453f32">1.1.6. Adaptive Cities</a></li>
<li><a href="#orge61d364">1.1.7. Automated Indoor Food Production</a></li>
<li><a href="#orgf8bb821">1.1.8. Transportation</a></li>
<li><a href="#org3637363">1.1.9. Logistics &amp; Distribution</a></li>
<li><a href="#org90b443a">1.1.10. Crowd-Sourced Constitution/Laws?</a></li>
<li><a href="#orgcdd06ce">1.1.11. Adaptive Health-Care: Beyond Insurance and Social Security</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf64984a">2. Approaches</a></li>
<li><a href="#orga25949f">3. Design Goals</a>
<ul>
<li><a href="#org1084b44">3.1. Dazza's Directives</a></li>
</ul>
</li>
<li><a href="#org4be978d">4. Buildable Options</a></li>
</ul>
</div>
</div>

<a id="org6f537f0"></a>

# Adaptive Governance Topics


<a id="org717ff73"></a>

## Example Contexts


<a id="orgd308706"></a>

### Managing common-pool resources

-   Water Rights
-   Game & Wildlife Population
    -   Fisheries


<a id="org30e5fa8"></a>

### Attestations in a Decentralized context

-   Land Rights


<a id="org194f0a7"></a>

### Carbon Credit exchange market


<a id="org16b66da"></a>

### Traffic/Parking Code


<a id="orgb0452b5"></a>

### Intent-Matching

-   Offer Networks:
    -   AI market-making based on asserted (and potentially inferred) intents. This is similar to kidney networks where donor-types and recipients don't always match, except here there are chains of different offers and requests. Offernetworks.
    -   balanced with perceived global health of the network by competing heterogeneous objective (functions), whose fitness is augmented by human input and interaction and other sensors/signals (the hypothesis here is that a singular objective function (make more $, increase production), without regard to external feedback leads to pathological structure)


<a id="org9453f32"></a>

### Adaptive Cities


<a id="orge61d364"></a>

### Automated Indoor Food Production


<a id="orgf8bb821"></a>

### Transportation


<a id="org3637363"></a>

### Logistics & Distribution


<a id="org90b443a"></a>

### Crowd-Sourced Constitution/Laws?

-   [Une Constitution européenne pour et par les citoyens - Le Taurillon, magazine eurocitoyenne](http://www.taurillon.org/une-constitution-europeenne-pour-et-par-les-citoyens)


<a id="orgcdd06ce"></a>

### Adaptive Health-Care: Beyond Insurance and Social Security


<a id="orgf64984a"></a>

# Approaches

-   Formal Logics (Rule-Based)
    -   Knowledge Representation (KR)
    -   Semantic Knowledge Graphs
    -   advantage: starts with a formal language that a machine can process and which can be made understandable to a human (RDF, JSON-LD)
    -   Linked Opend Data
        -   [LOD Laundromat](http://lodlaundromat.org/):
            Access to *all* linked open data and data cleaning
        -   [JSON-LD - JSON for Linking Data](https://json-ld.org/)
        -   <http://rdfa.info/>
-   Statistical Models & Methods
    -   Machine Learning Techniques
        -   advantage: 
            -   statistical methods are proving promising to scale
        -   disadvantage:
            -   needs a lot of data and processing power
            -   not always clear how we got to final output
            -   bias in data is reflected in output
            -   results highly correlated/coupled with dataset learned on
            -   cannot compose semantically with other system


<a id="orga25949f"></a>

# Design Goals

-   To demonstrate a general design pattern for a generic data-driven adaptive rules engine


<a id="org1084b44"></a>

## Dazza's Directives

-   following a *more general* not more specific path for **simplest and shortest** route to a demo-able thing that is
    -   sufficient relevant
    -   ready to present
-   focus on a **technical governance automation** capability
    -   Postulating some contexts:
        1.  a voluntary carbon credit exchange market
        2.  a municipal traffic/parking code)
-   *data-centric* (eg JSON other data file)
-   the data and code operate and complements the words spoken by the person demonstrating the code
-   **propose a project to code and describe**
    -   the sort of data it would invest
    -   the behavior it would exhibit
-   **solicit feedback from broader community** to help propose and specify relevant options
    -   to suss out good alternatives to when selecting the specific “adaptation” functionality to be demonstrated.
-   **savagely narrow in scope at the system rules level**
-   agnostic as to the rules governing specific software agents for the moment because they are different beasts and doing both risks ending up with nothing in time to demo
-   **system rules are the clearest type to demo adaptive governance in an economic system**
    -   **rules that define and regulate**:
        -   the types of market transactions
        -   the combinations of parties/roles/relationships
        -   the velocity/size/etc of deal flow
        -   the range of goods/services exchanged


<a id="org4be978d"></a>

# Buildable Options

-   (eg: open source software, available API's and other services, other options, etc)

